{
  "blog-minecraft-server-title": "Private Minecraft Server: VPN, Backup & Performance Optimization",
  "blog-minecraft-server-meta-description": "A hands-on blog about setting up and optimizing a private Minecraft server with Docker, OpenVPN, RAID backups, and resource-efficient server configuration.",
  "blog-minecraft-server-heading": "Private Minecraft Server: VPN, Backup & Performance Optimization",
  
  "blog-minecraft-server-section-1-title": "Why Run a Private Minecraft Server?",
  "blog-minecraft-server-section-1-text": "I run my own Minecraft server to have full control over the game environment, security, and performance. With a self-hosted setup, I can create custom certificates for VPN connections and optimize the server efficiently.",

  "blog-minecraft-server-section-2-title": "System Architecture & Backups",
  "blog-minecraft-server-section-2-text": "The server runs on Linux, secured with RAID-1 and regular backups. This ensures that data and worlds are always protected. The architecture is designed to save resources and run the server.jar efficiently.",

  "blog-minecraft-server-section-3-title": "Setup with Docker",
  "blog-minecraft-server-section-3-text": "The server runs inside a Docker container, simplifying maintenance and isolating the environment. Updates and configurations can be handled efficiently through this setup.",

  "blog-minecraft-server-section-4-title": "Access via VPN",
  "blog-minecraft-server-section-4-text": "Players connect through an OpenVPN network, so no direct port forwarding to the internet is required. All connections are encrypted and secured with custom certificates.",

  "blog-minecraft-server-section-5-title": "What I Learned",
  "blog-minecraft-server-section-5-list-1": "Setting up and securing a private server including VPN authentication",
  "blog-minecraft-server-section-5-list-2": "Efficient server configuration and resource optimization",
  "blog-minecraft-server-section-5-list-3": "Backup strategies with RAID and automation scripts",

  "blog-minecraft-server-section-6-title": "Conclusion",
  "blog-minecraft-server-section-6-text": "Running my own Minecraft server is a practical project that demonstrates my skills in server management, security, automation, optimization, and containerization.",

  "blog-minecraft-server-back-button": "Back to Main Page"
}
