{
  "blog-discord-bot-title": "🤖 Custom Discord Bot for Community Management",
  "blog-discord-bot-meta-description": "A multilingual Discord bot for moderation, automation, and community tools.",
  "blog-discord-bot-heading": "🤖 Custom Discord Bot for Community Management",
  "section-discord-intro": "<strong>Discord</strong> is a popular platform for communities that supports text, voice, and video chats. My bot automates tasks on Discord servers, makes event organization easier, and supports multilingual communication, saving community managers time and keeping everything organized.",
  "section-signup-screenshots-title": "Signup in Action",
  "section-signup-screenshots-text": "Here's what event registration looks like directly on the Discord server:",
  "section-core-features-title": "Core Features",
  "section-core-features-text": "Custom-built Discord bot with event templates, translations, and admin features. Supports live and test systems, automates community management, and simplifies moderation – used by over 140 users.",
  "section-technical-architecture-title": "Technical Architecture",
  "section-technical-architecture-text": "The bot runs on Python and uses the Discord API via slash commands and buttons. Deployment is done in Docker containers on Linux systems. Templates and modular structures enable flexible event organization and clear administration.",
  "section-challenges-title": "Challenges",
  "section-challenges-text": "Implementing a scalable event system with test and live environments, multilingual support, template logic, and admin features required complex data structures and command handling.",
  "section-conclusion-outlook-title": "Conclusion & Outlook",
  "section-conclusion-outlook-text": "The bot is already used by over 140 users and greatly simplifies daily community management. Development is active, and the following features are on the roadmap:",
  "section-conclusion-outlook-text2": "The goal is to continuously improve the bot, integrate new tools, and provide a powerful, flexible tool for medium to large Discord servers.",
  "back-button": "Back to main page",
  
  "cmd-signup": "<strong>/signup</strong> – Register for events. Automatically triggers an event template so pre-made events can be created quickly. Includes multi-account support, separate threads, and status options.",
  "cmd-signup_custom": "<strong>/signup_custom</strong> – Create custom events independent of templates.",
  "cmd-ping_role": "<strong>/ping_role</strong> – Notify roles directly.",
  "cmd-translate": "<strong>/translate</strong> & <strong>/translate_section</strong> – Automatically translate individual messages or entire message sections.",
  "cmd-create_translation_button": "<strong>/create_translation_button</strong> – Creates buttons with language flags under a message section. Clicking a flag delivers the translation.",
  "cmd-clear_translation_cache": "<strong>/clear_translation_channel_cache</strong> & <strong>/clear_translation_cache_msg</strong> – Manage translation cache.",
  "cmd-users": "<strong>/users_in_server</strong> & <strong>/users_in_role</strong> – Overview of members and roles.",
  "cmd-list_events": "<strong>/list_events</strong> – Displays all events on the server.",
  "cmd-embed_description": "<strong>/embed_description</strong> – Admin tool to automatically create Discord embeds.",
  "cmd-signup_delete": "<strong>/signup_delete</strong> – Delete signup events (admin only).",
  "cmd-get_logs": "<strong>/get_logs</strong> – View all activity (admin only).",
  "cmd-help": "<strong>/help</strong> – Quickly create a bug ticket if issues occur.",

  "cmd-signup_repeat": "<strong>/signup repeat</strong> – Automatically create recurring events",
  "cmd-statistics": "<strong>/statistics</strong> – Overview of user activity and event participation",
  "cmd-ping_all_signed": "<strong>Ping All Signed-Up Users</strong> – With a handy info button for quick notifications",
  "cmd-template_improvements": "Further improvements to the event template system",
  "cmd-translation_improvements": "Expansion of translation features and language support"
}
