{
  "blog-minecraft-server-title": "Privater Minecraft-Server: VPN, Backup & Performance-Optimierung",
  "blog-minecraft-server-meta-description": "Ein praxisnaher Blog über den Aufbau und die Optimierung eines privaten Minecraft-Servers mit Docker, OpenVPN, RAID-Backups und ressourcenschonender Serverkonfiguration.",
  "blog-minecraft-server-heading": "Privater Minecraft-Server: VPN, Backup & Performance-Optimierung",
  
  "blog-minecraft-server-section-1-title": "Warum ein eigener Minecraft-Server?",
  "blog-minecraft-server-section-1-text": "Ich betreibe einen eigenen Minecraft-Server, um die volle Kontrolle über Spielumgebung, Sicherheit und Performance zu haben. Durch die Self-Hosting-Lösung kann ich eigene Zertifikate für VPN-Verbindungen erstellen und den Server effizient optimieren.",

  "blog-minecraft-server-section-2-title": "Systemarchitektur & Backups",
  "blog-minecraft-server-section-2-text": "Der Server läuft auf Linux, abgesichert durch RAID-1 und regelmäßige Backups. Dadurch sind Daten und Welten stets geschützt. Die Architektur ist darauf ausgelegt, Ressourcen zu sparen und die Server.jar effizient auszuführen.",

  "blog-minecraft-server-section-3-title": "Setup mit Docker",
  "blog-minecraft-server-section-3-text": "Der Server läuft in einem Docker-Container, was die Wartung vereinfacht und die Umgebung isoliert. Updates und Konfigurationen lassen sich dadurch effizient handhaben.",

  "blog-minecraft-server-section-4-title": "Zugriff über VPN",
  "blog-minecraft-server-section-4-text": "Spieler verbinden sich über ein OpenVPN-Netzwerk, sodass keine direkten Portfreigaben ins Internet nötig sind. Alle Verbindungen sind verschlüsselt und mit eigenen Zertifikaten abgesichert.",

  "blog-minecraft-server-section-5-title": "Was ich dabei gelernt habe",
  "blog-minecraft-server-section-5-list-1": "Aufbau und Absicherung eines privaten Servers inkl. VPN-Authentifizierung",
  "blog-minecraft-server-section-5-list-2": "Effiziente Serverkonfiguration und Ressourcenoptimierung",
  "blog-minecraft-server-section-5-list-3": "Backup-Strategien mit RAID und Automatisierungsskripten",

  "blog-minecraft-server-section-6-title": "Fazit",
  "blog-minecraft-server-section-6-text": "Der eigene Minecraft-Server ist ein praxisnahes Projekt, das sowohl meine Fähigkeiten in Server-Management, Sicherheit und Automatisierung als auch in Optimierung und Containerisierung demonstriert.",

  "blog-minecraft-server-back-button": "Zurück zur Hauptseite"
}
