{
  "blog-discord-webpage-title": " Webseite für einen MMO Community Discord-Server",
  "blog-discord-webpage-meta-description": "Eine professionelle Webseite zur Unterstützung eines MMO Discord-Servers mit Guides, News und Partnern.",
  "blog-discord-webpage-heading": " Webseite für einen<br>MMO Community Discord-Server",
  "blog-discord-webpage-published": "Veröffentlicht am: 02. August 2025",
  "section-guides-title": "Guides & Tutorials ",
  "section-guides-intro": "Die Webseite bietet umfangreiche Schritt-für-Schritt-Anleitungen, die Spielern helfen, das MMO besser zu verstehen und ihre Fähigkeiten zu verbessern. Von Einsteiger-Tipps bis hin zu komplexen Strategien - alles praxisnah und verständlich aufbereitet.",
  "section-guides-list-1": "Charakterentwicklung & Skill-Builds",
  "section-guides-list-2": "Event- und Raid-Guides",
  "section-guides-list-3": "Erklärungen von Spielmechaniken",
  "section-guides-list-4": "Spielspezifische Commands",
  "section-news-title": "Community News & Updates ",
  "section-news-intro": "Der News-Bereich informiert regelmäßig über aktuelle Ereignisse, Ankündigungen und wichtige Community-News rund um den Discord-Server. So bleiben die Mitglieder stets bestens auf dem Laufenden.",
  "section-affiliates-title": "Affiliates ",
  "section-affiliates-intro": "Der Affiliates-Bereich stellt befreundete Gilden und Partner vor, die eng mit unserer Community verbunden sind. Dies fördert den Austausch und stärkt das Netzwerk innerhalb der MMO-Community.",
  "section-affiliates-detail": "Die Vorstellung erfolgt übersichtlich mit Informationen zu den jeweiligen Schwerpunkten der Gilden.",
  "section-technical-info-title": "Technische Umsetzung ",
  "section-technical-info-text": "Die Webseite ist vollständig mobiloptimiert und bietet eine nahtlose Integration mit dem Discord-Server, sodass Besucher mit wenigen Klicks Teil der Community werden können. Derzeit liegt der Fokus auf einer englischsprachigen Oberfläche.",
  "back-button": "Zurück zur Hauptseite",
  "section-support-description": "Diese Webseite wurde speziell entwickelt, um die Spieler des MMO-Discord-Servers bestmöglich zu unterstützen. Sie bündelt hilfreiche Ressourcen, aktuelle Informationen und Partnerschaften an einem zentralen Ort.",
  "section-news-exchange": "Die enge Verzahnung mit dem Discord-Server fördert den aktiven Austausch und stärkt das Gemeinschaftsgefühl.",
   "section-future-features": "Für zukünftige Versionen sind weitere Features geplant, darunter mehrsprachige Unterstützung, ein erweiterter Guide-Bereich, ein Art-Bereich für kreative Community-Mitglieder sowie ein Achievements-Bereich, in dem Gilden-Erfolge dokumentiert und besondere Leistungen gefeiert werden."
}
