{
  "blog-discord-bot-title": "🤖 Eigener Discord-Bot für Community-Management",
  "blog-discord-bot-meta-description": "Ein mehrsprachiger Discord-Bot für Moderation, Automatisierung und Community-Tools.",
  "blog-discord-bot-heading": "🤖 Eigener Discord-Bot für Community-Management",
  "section-discord-intro": "<strong>Discord</strong> ist eine beliebte Plattform für Communities, die Text-, Sprach- und Video-Chats unterstützt. Mein Bot automatisiert Aufgaben auf Discord-Servern, erleichtert die Organisation von Events und unterstützt mehrsprachige Kommunikation, sodass Community-Manager Zeit sparen und die Übersicht behalten.",
  "section-signup-screenshots-title": "Signup im Einsatz",
  "section-signup-screenshots-text": "So sieht die Anmeldung für ein Event direkt auf dem Discord-Server aus:",
  "section-core-features-title": "Kernfunktionen",
  "section-core-features-text": "Eigenentwickelter Discord-Bot mit Event-Templates, Übersetzungen und Admin-Features. Unterstützt Live- und Test-Systeme, automatisiert Community-Management und erleichtert Moderation - im Einsatz bei über 140 Nutzern.",
  "section-technical-architecture-title": "Technischer Aufbau",
  "section-technical-architecture-text": "Der Bot läuft in Python und nutzt die Discord-API via Slash-Commands und Buttons. Deployment erfolgt in Docker-Containern auf Linux-Systemen. Templates und modulare Strukturen ermöglichen flexible Event-Organisation und übersichtliche Administration.",
  "section-challenges-title": "Herausforderungen",
  "section-challenges-text": "Die Implementierung eines skalierbaren Event-Systems mit Test- und Live-Umgebung, Mehrsprachigkeit, Template-Logik und Admin-Funktionen stellte komplexe Anforderungen an Datenstrukturen und Kommando-Handling.",
  "section-conclusion-outlook-title": "Fazit & Ausblick",
  "section-conclusion-outlook-text": "Der Bot ist bereits bei über 140+ Nutzern im Einsatz und erleichtert das tägliche Community-Management erheblich. Die Entwicklung ist aktiv, und folgende Funktionen stehen auf der Roadmap:",
  "section-conclusion-outlook-text2": "Ziel ist es, den Bot ständig weiterzuentwickeln, neue Tools zu integrieren und ein leistungsfähiges, flexibles Werkzeug für mittelgroße bis große Discord-Server bereitzustellen.",
  "back-button": "Zurück zur Hauptseite",
  
  "cmd-signup": "<strong>/signup</strong> - Anmeldung für Events. Löst automatisch ein Event-Template aus, sodass vorgefertigte Events schnell erstellt werden können. Multiaccount-Support, eigene Threads und Statusoptionen inklusive.",
  "cmd-signup_custom": "<strong>/signup_custom</strong> - Eigene Event-Erstellung, unabhängig von Templates.",
  "cmd-ping_role": "<strong>/ping_role</strong> - Rollen direkt benachrichtigen.",
  "cmd-translate": "<strong>/translate</strong> & <strong>/translate_section</strong> - Automatische Übersetzung einzelner Nachrichten oder ganzer Nachrichten-Section.",
  "cmd-create_translation_button": "<strong>/create_translation_button</strong> - Unter einer Nachrichten-Section werden Buttons mit Sprachflaggen erstellt. Klick auf eine Flagge liefert die Übersetzung.",
  "cmd-clear_translation_cache": "<strong>/clear_translation_channel_cache</strong> & <strong>/clear_translation_cache_msg</strong> - Cache-Verwaltung für Übersetzungen.",
  "cmd-users": "<strong>/users_in_server</strong> & <strong>/users_in_role</strong> - Übersicht über Mitglieder und Rollen.",
  "cmd-list_events": "<strong>/list_events</strong> - Anzeige aller Events auf dem Server.",
  "cmd-embed_description": "<strong>/embed_description</strong> - Admin-Tool, um Discord Embeds automatisch erstellen zu lassen.",
  "cmd-signup_delete": "<strong>/signup_delete</strong> - Löschen von Signup-Events (nur für Admins).",
  "cmd-get_logs": "<strong>/get_logs</strong> - Einblick in alle Aktivitäten (nur für Admins).",
  "cmd-help": "<strong>/help</strong> - Schnell ein Bug-Ticket erstellen, falls Probleme auftreten.",

  "cmd-signup_repeat": "<strong>/signup repeat</strong> - Wiederholende Events automatisch anlegen",
  "cmd-statistics": "<strong>/statistics</strong> - Übersicht über Nutzeraktivität und Event-Teilnahmen",
  "cmd-ping_all_signed": "<strong>Ping All Signed-Up Users</strong> - Mit praktischem Info-Button für schnelle Benachrichtigungen",
  "cmd-template_improvements": "Weitere Verbesserungen im Event-Template-System",
  "cmd-translation_improvements": "Erweiterung der Übersetzungsfunktionen und Sprachunterstützung"
}
