{
  "main-page.title": "Willi Müller - Softwareentwickler",
  "main-page.meta-description": "Portfolio von Willi Müller, Softwareentwickler für moderne, effiziente und nachhaltige Softwarelösungen.",

  "main-page.header-title": "Willi Müller",
  "main-page.header-subtitle": "Als angehender Entwickler liegt mein Fokus auf klarer, lösungsorientierter Software.",

  "main-page.projects-title": "Meine öffentlichen Projekte",
  "main-page.tech-title": "IT-Kenntnisse",
  "main-page.prog-title": "Programmiersprachen",
  "main-page.tools-title": "Tools & Plattformen",

  "main-page.about-me-title": "Über mich",
  "main-page.about-me-p1": "IT und Technik faszinieren mich seit jeher. Privat baue ich eigene Server auf und experimentiere mit modernen Technologien, um mein Verständnis von IT-Infrastrukturen stetig zu vertiefen. Neben der Infrastrukturentwicklung programmiere ich auch Software - so wie in meinen Projekten gezeigt - und finde großen Spaß daran, technische Herausforderungen praxisnah und kreativ zu lösen.",
  "main-page.about-me-p2": "In meiner Ausbildung liegt mein Fokus auf Softwareentwicklung, wobei ich meine Programmierkenntnisse täglich erweitere. DevOps, Systemadministration und weitere IT-Bereiche wende ich durch eigene Projekte und praktische Erfahrungen in meinem Home-Lab an und vertiefe so mein Verständnis. Zusätzlich unterstütze ich Freunde und Familie bei IT-Fragen, was mir hilft, mein Wissen praxisnah einzusetzen und weiter auszubauen.",
  "main-page.about-me-p3": "Teamarbeit und eigenverantwortliches Lernen sind für mich selbstverständlich, weil ich weiß, dass gerade der Austausch im Team und das selbstständige Erarbeiten neuer Inhalte der Schlüssel zu erfolgreicher und nachhaltiger Softwareentwicklung sind. Ich freue mich darauf, mein Know-how in spannenden Projekten weiter auszubauen und nachhaltige Softwarelösungen zu schaffen.",

  "main-page.blog-title": "Wissensbereich",

  "main-page.blog-post-1-title": "Minecraft-Server auf dem eigenen Homeserver",
  "main-page.blog-post-1-desc": "Einblicke in den jährlichen Aufbau meines privaten Minecraft-Servers.",
  "main-page.blog-post-1-link": "Weiterlesen",

  "main-page.blog-post-2-title": "Eigener Discord-Bot für Community-Management",
  "main-page.blog-post-2-desc": "Entwicklung eines vielseitigen Bots zur Moderation, Automatisierung und Unterstützung eines mehrsprachigen Discord-Servers.",
  "main-page.blog-post-2-link": "Weiterlesen",

  "main-page.blog-post-3-title": "Webseite für einen<br> MMO Community Discord-Server",
  "main-page.blog-post-3-desc": "Eine Webseite mit Guides, Tools und Informationen, die den Discord-Server unterstützt und das Community-Management erleichtert.",
  "main-page.blog-post-3-link": "Weiterlesen",

  "main-page.blog-post-4-title": "Individuelle PC-Beratung",
  "main-page.blog-post-4-desc": "Erfahrungen beim Zusammenstellen und Einrichten maßgeschneiderter PCs.",
  "main-page.blog-post-4-link": "Weiterlesen",

  "main-page.blog-post-5-title": "Meine erste Game Jam",
  "main-page.blog-post-5-desc": "Ein Erfahrungsbericht - von der Idee über die Umsetzung bis zum finalen Spiel.",
  "main-page.blog-post-5-link": "Weiterlesen",

  "main-page.contact-intro": "Sie möchten gerne mit mir in Kontakt treten? <br>Falls ich Ihr Interesse geweckt habe, erreichen Sie mich hier:",

  "main-page.contact-email": "E-Mail",
  "main-page.contact-github": "GitHub",
  "project-github-link": "Zu GitHub"

}
